# Settings
cask_args appdir: '/Applications'

# Brews
brew 'ack'
brew 'angluar-cli'
brew 'awscli'
brew 'bash'
brew 'cocoapods'
brew 'cscope'
brew 'ctags'
brew 'dos2unix'
brew 'ffmpeg'
brew 'gdbm'
brew 'git'
brew 'gitmoji'
brew 'git-flow'
brew 'git-open'
brew 'git-town'
brew 'gpg'
brew 'httpie'
brew 'hugo'
brew 'macvim'
brew 'neofetch'
brew 'nmap'
brew 'node'
brew 'nvm'
brew 'openssl'
brew 'pcre'
brew 'readline'
brew 'ripgrep'
brew 'stow'
brew 'terraform'
brew 'trash'
brew 'typescript'
brew 'thefuck'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'youtube-dl'
# zsh
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# Casks
cask '1password'
cask 'appcleaner'
cask 'atom'
cask 'balenaetcher'
cask 'deluge'
# non-cask doesn't install docker daemon!
cask 'docker'
cask 'firefox'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'kindle'
cask 'krita'
cask 'slack'
cask 'telegram'
cask 'transmit'
cask 'tower'
cask 'typora'
cask 'visual-studio-code'

# Fonts -- removed because homebrew's update will always pull these
# cask 'font-hack'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-input'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'
