# Settings
cask_args appdir: '/Applications'

# Taps
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'buo/cask-upgrade'

# Brews
brew 'ack'
brew 'ant'
brew 'awscli'
brew 'bash'
brew 'cscope'
brew 'ctags'
brew 'dos2unix'
brew 'ffmpeg'
brew 'fish'
brew 'gdbm'
brew 'git'
brew 'gitmoji'
brew 'git-flow'
brew 'git-open'
brew 'git-town'
brew 'httpie'
brew 'hugo'
brew 'mas'
brew 'maven'
brew 'neofetch'
brew 'nmap'
brew 'node'
brew 'nvm'
brew 'openssl'
brew 'pcre'
brew 'python'
brew 'readline'
brew 'stow'
brew 'terraform'
brew 'thefuck'
brew 'vim'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# Casks
cask '1password'
cask 'appcleaner'
cask 'atom'
cask 'deluge'
cask 'docker'
cask 'eclipse-java'
cask 'firefox'
cask 'java'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'kindle'
cask 'koala'
cask 'krita'
cask 'macdown'
#cask 'macvim'
cask 'postman'
#cask 'sketch'
cask 'transmit'
cask 'tower'
cask 'visual-studio-code'
cask 'vmware-fusion'

# quick-look plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
#cask 'quicklook-json'
#cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'


# Fonts -- removed because homebrew's update will always pull these
# cask 'font-hack'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-input'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'
