# Settings
cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'caskroom/cask'

# Brews
brew 'ack'
brew 'ant'
brew 'awscli'
brew 'bash'
brew 'cscope'
brew 'dos2unix'
brew 'fish'
brew 'gdbm'
brew 'git'
brew 'hugo'
brew 'jenv'
brew 'mas'
brew 'maven'
brew 'node'
brew 'openssl'
brew 'pcre'
brew 'python'
brew 'readline'
brew 'terraform'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'

# Casks
cask '1password'
cask 'appcleaner'
cask 'atom'
cask 'balsamiq-mockups'
cask 'battle-net'
cask 'calibre'
cask 'deluge'
cask 'docker'
cask 'doxie'
cask 'eclipse-java'
cask 'firefox'
cask 'geekbench'
cask 'github-desktop'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'kaleidoscope'
cask 'kindle'
cask 'little-snitch'
cask 'macvim'
cask 'micro-snitch'
cask 'transmit'
cask 'tower'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'superduper'
cask 'visual-studio-code'
cask 'vmware-fusion'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas '1Password', id: 443987910
mas '1Blocker', id: 1107421413
mas 'Marked 2', id: 890031187
mas 'microsoft-remote-desktop', id: 715768417
mas 'Pages', id: 409201541
mas 'Pixelmator', id: 407963104
mas 'Reeder', id: 880001334
mas 'Sketch', id: 402476602
mas 'Tweetbot', id: 557168941
mas 'the-unarchiver', id: 425424353
mas 'Xcode', id: 497799835
