# Settings
cask_args appdir: '/Applications'

# Taps
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'buo/cask-upgrade'

# Brews
brew 'ack'
brew 'ant'
brew 'awscli'
brew 'bash'
brew 'cscope'
brew 'dos2unix'
brew 'fish'
brew 'gdbm'
brew 'git'
brew 'git-flow'
brew 'hugo'
brew 'jenv'
brew 'mas'
brew 'maven'
brew 'nmap'
brew 'node'
brew 'openssl'
brew 'pcre'
brew 'python'
brew 'readline'
brew 'terraform'
brew 'thefuck'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# Casks
cask '1password'
cask 'appcleaner'
cask 'atom'
cask 'balsamiq-mockups'
cask 'calibre'
cask 'docker'
cask 'doxie'
cask 'eclipse-java'
cask 'firefox'
cask 'github-desktop'
cask 'google-chrome'
cask 'highsierramediakeyenabler'
cask 'hyper'
cask 'iterm2'
cask 'java'
cask 'kaleidoscope'
cask 'kindle'
cask 'koala'
cask 'macdown'
cask 'macvim'
cask 'postman'
cask 'rescuetime'
cask 'signal'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'transmit'
# temporary removal for beta channel
# cask 'tower'
cask 'tower-beta'
cask 'transmission'
cask 'visual-studio-code'
cask 'vmware-fusion'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-input'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas '1Blocker', id: 1107421413
mas 'microsoft-remote-desktop', id: 715768417
mas 'Pages', id: 409201541
mas 'PiPifier', id: 1160374471
mas 'Pixelmator', id: 407963104
mas 'Reeder', id: 880001334
mas 'Tweetbot', id: 1384080005
mas 'the-unarchiver', id: 425424353
mas 'Xcode', id: 497799835
