# Settings
cask_args appdir: '/Applications'

# Taps
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'buo/cask-upgrade'                              # adds 'brew cu' to upgrade casks

# Brews
brew 'ack'
brew 'ant'
brew 'awscli'
brew 'bash'
brew 'cscope'
brew 'dos2unix'
brew 'fish'
brew 'gdbm'
brew 'git'
brew 'hugo'
brew 'jenv'
brew 'mas'
brew 'maven'
brew 'nmap'
brew 'node'
brew 'openssl'
brew 'pcre'
brew 'python'
brew 'readline'
brew 'terraform'
brew 'thefuck'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'

# Casks
#                                                   # Linux equivalents
cask '1password'                                    # lastpass / keepass
cask 'appcleaner'                                   # None needed (package managers)
cask 'atom'                                         # Atom
cask 'balsamiq-mockups'                             # ???
#cask 'battle-net'                                   # ---
cask 'brave'
cask 'cakebrew'                                     # None needed (package manager UIs)
cask 'calibre'                                      # calibre
#cask 'carbon-copy-cloner'                           # ???
cask 'deluge'                                       # deluge
cask 'docker'                                       # docker
cask 'doxie'                                        # ---
cask 'eclipse-java'                                 # eclipse
cask 'firefox'                                      # firefox
cask 'geekbench'                                    # ---
cask 'github-desktop'                               # ---
cask 'google-chrome'                                # google-chrome
cask 'hyper'
cask 'iterm2'                                       # gnome-terminal
cask 'java'                                         # java
cask 'kaleidoscope'                                 # ???
cask 'kindle'                                       # ???
cask 'little-snitch'                                # ???
cask 'macvim'                                       # gvim
cask 'marked'                                       # ???
cask 'micro-snitch'                                 # ???
cask 'transmit'                                     # ???
cask 'tower'                                        # ---
cask 'sketch'                                       # ???
cask 'slack'                                        # slack
#cask 'spotify'                                      # spotify web
#cask 'steam'                                        # steam
cask 'visual-studio-code'                           # visual studio code
cask 'vmware-fusion'                                # vmware workstation for linux

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas '1Blocker', id: 1107421413                      # ghostery
mas 'Blackmagic Disk Speed Test', id: 425264550     # meh.
mas 'microsoft-remote-desktop', id: 715768417       # ???
mas 'Pages', id: 409201541                          # google docs / libreoffice
mas 'PiPifier', id: 1160374471                      # PiP all the things
mas 'Pixelmator', id: 407963104                     # gimp
mas 'Reeder', id: 880001334                         # FeedReader
mas 'Speedtest by Ookla', id: 1153157709            # speedtest.net
mas 'Tweetbot', id: 557168941                       # twitter web
mas 'the-unarchiver', id: 425424353                 # built-in?
mas 'Xcode', id: 497799835                          # AndroidStudio
