# Taps
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/cask'              # Only works on macOS
tap 'homebrew/cask-fonts'        # Only works on macOS

# Brews
brew 'ack'                  # code search tool
brew 'ag'                   # another code search tool
brew 'awscli'               # AWS cli client
brew 'bat'                  # a 'cat' replacement with syntax highlighting and paging
brew 'diff-so-fancy'        # a better diff
brew 'dos2unix'             # convert dos files to unix line endings
brew 'exa'                  # a replacement ls supporting git and tree
brew 'fasd'                 # a better find
brew 'fd'                   # a better find too
brew 'ffmpeg'               # audio/visual conversion tool
brew 'fish'                 # fish shell (not POSIX compliant)
brew 'fisher'               # fish shell plugin manager
brew 'fortune'              # words of wisdom
brew 'fzf'                  # fuzzy file finder (shell and vim!)
brew 'git'                  # source control
# brew 'go'                   # Go lang
# brew 'git-flow'             # standard git workflows
brew 'gpg'                  # encryption utils
brew 'htop'                 # system stats
brew 'jq'                   # json formatter
brew 'lua'                  # Scripting language, extraordinaire!
brew 'luarocks'             # Lua package manager
brew 'macos-trash'          # utility to leverage the trashcan from the shell
# brew 'trash-cli'            # linux equivalent of macos-trash
brew 'neofetch'             # graphical system summary
brew 'neovim'               # preferred vim
brew 'nmap'                 # port scanning util
brew 'nvm'                  # node version manager
brew 'openssl'              # ssl utilities
brew 'prettyping'           # a better ping
brew 'readline'             # dunno
brew 'ripgrep'              # a faster grep
# brew 'rust'                 # Rust lang
brew 'starship'             # The best prompt for any shell
brew 'stow'                 # dotfile installation utility
brew 'tldr'                 # a more concise man replacement
brew 'tmux'                 # terminal multiplexer (not yet used)
brew 'tree'                 # directory tree
brew 'wget'                 # alternative shell web download util
brew 'yarn'                 # alternative to npm
brew 'yt-dlp'               # download youtube videos
brew 'zoxide'               # a better autojump & cd combined
brew 'zx'                   # javascript shell scripts

# zsh
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# Casks (Note: Only works on macOS)
cask 'alacritty'              # gpu accelerated terminal
cask 'alfred'                 # application launcher and more
# cask 'amethyst'               # tiling window manager
cask 'appcleaner'             # clean uninstalls
cask 'balenaetcher'           # USB ISO creator
# cask 'caldigit-docking-utility' # dock app
# cask 'calibre'                # ebook utilities
cask 'devtoys'                # convenience app for handy developer tools
cask 'discord'                # alternate comms
cask 'docker'                 # container software
# cask 'figma'                  # design software
cask 'firefox'                # open source web browser
# cask 'github'                 # github client
cask 'hammerspoon'            # programmable mac automation
cask 'handbrake'              # video encoder
# cask 'kaleidoscope'           # Rich diffs
cask 'karabiner-elements'     # low-level keyboard and mouse control
# cask 'krita'                  # open source paint app
# cask 'netnewswire'            # RSS feed reader
# cask 'openaudible'            # download / process audible content
cask 'postman'                # work with REST APIs
cask 'rectangle'              # window management
cask 'slack'                  # workplace comms
cask 'visual-studio-code'     # Microsoft cross-platform editor
cask 'Whisky'                 # Stronger than WINE

# Fonts
# Patched with nerd font support are good for Terminal but iTerm2 has built-in glyphs.
# Fonts would also include source-code-pro but that one will reinstall
# every brew update.
cask 'font-sf-pro'
cask 'font-sf-mono'
# cask 'font-sf-mono-for-powerline' # ligatures for SF Mono
cask 'font-monaspace'         # GitHub monospace fonts
cask 'font-cascadia-code'     # nerdfont: font-caskaydia-cove-nerd-font
cask 'font-dejavu'            # nerdfont: font-dejavu-sans-mono-nerd-font
cask 'font-fira-code'         # nerdfont: font-fira-code-nerd-font
cask 'font-fira-code-nerd-font'
cask 'font-jetbrains-mono'    # nerdfont: font-jetbrains-mono-nerd-font
cask 'font-hack'
cask 'font-hasklig'
# cask 'font-source-code-pro' # will always update if installed...
cask 'font-sauce-code-pro-nerd-font' # source code pro nerd font
cask 'font-geist'             # Vercel created font
cask 'font-geist-mono'        # and its mono version
