# Taps
tap 'homebrew/cask-fonts'   # Note: Only works on macOS

# Brews
brew 'ack'                  # code search tool
brew 'ag'                   # another code search tool
brew 'autojump'             # jump to directories fast!
brew 'awscli'               # AWS cli client
brew 'bat'                  # a 'cat' replacement with syntax highlighting and paging
brew 'diff-so-fancy'        # a better diff
brew 'dos2unix'             # convert dos files to unix line endings
brew 'exa'                  # a replacement ls supporting git and tree
brew 'fasd'                 # a better find
brew 'fd'                   # a better find too
brew 'ffmpeg'
brew 'firebase-cli'         # Firebase CLI
brew 'fish'                 # alternative shell (not POSIX compliant)
brew 'fortune'              # words of wisdom
brew 'fzf'                  # fuzzy file finder (shell and vim!)
brew 'git'                  # source control
brew 'git-flow'             # standard git workflows
brew 'git-open'             # open git repository webpage from the shell
brew 'gpg'                  # encryption utils
brew 'htop'                 # system stats
brew 'httpie'
brew ‘macos-trash'          # utility to leverage the trashcan from the shell
# brew 'trash-cli'            # linux equivalent of macos-trash
# brew 'mailtrackerblocker'   # block remote loading images in mail
brew 'mas'                  # required for mas apps below
brew 'neofetch'             # graphical system summary
brew 'neovim'               # preferred vim
brew 'nmap'                 # port scanning util
brew 'nvm'                  # install nvm, install all node versions using nvm.
brew 'noti'                 # macOS command line notification hook
brew 'openssl'              # ssl utilities
brew 'prettyping'           # a better ping
brew 'readline'             # dunno
brew 'ripgrep'              # a faster grep
brew 'starship'             # The best prompt for any shell
brew 'stow'                 # dotfile installation utility
brew 'thefuck'              # command correction utility
brew 'tldr'                 # a more concise man replacement
brew 'tmux'                 # terminal multiplexer (not yet used)
brew 'tmuxinator'           # tmux projects
brew 'tree'                 # directory tree
brew 'wget'                 # alternative shell web download util
brew 'yarn'                 # alternative to npm
brew 'youtube-dl'           # download youtube videos

# zsh
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'zsh-you-should-use'

# Casks (Note: Only works on macOS)
cask '1password'              # password manager
cask 'adoptopenjdk'           # install java dev
cask 'aerial'                 # picturesque screensaver
cask 'alfred'                 # application launcher and more
cask 'appcleaner'             # clean uninstalls
cask 'balenaetcher'           # ISO -> USB writing app
cask 'boop'                   # Scriptable text engine
cask 'calibre'                # ebook utilities
cask 'discord'                # alternate comms
cask 'docker'                 # container software
cask 'figma'                  # design software
cask 'firefox'                # open source web browser
cask 'github'                 # cli github client
cask 'iterm2'                 # a more feature-rich terminal
cask 'kaleidoscope'           # Rich diffs
cask 'karabiner-elements'     # low-level keyboard and mouse control
cask 'krita'                  # open source paint app
cask 'netnewswire'            # RSS feed reader
cask 'openaudible'            # download / process audible content
cask 'postman'                # work with REST APIs
cask 'slack'                  # online chat rooms
cask 'transmit'               # ftp/sftp/etc app
cask 'twitch'                 # live coding!
cask 'visual-studio-code'     # Microsoft cross-platform editor

# Fonts
# Patched with nerd font support are good for Terminal but iTerm2 has built-in glyphs.
# Fonts would also include source-code-pro but that one will reinstall
# every brew update.
cask 'font-sf-pro'
cask 'font-sf-mono'
cask 'font-cascadia-code'     # nerdfont: font-caskaydia-cove-nerd-font
cask 'font-dejavu'            # nerdfont: font-dejavu-sans-mono-nerd-font
cask 'font-fira-code'
cask 'font-hack'
cask 'font-hasklig'
# cask 'font-source-code-pro' # will always update if installed...
cask 'font-sauce-code-pro-nerd-font'

# Mac App Store Apps (macOS only, obviously)
mas 'Xcode', id: 497799835
mas 'Apple Developer', id: 640199958
mas 'Moom', id: 419330170                           # Window Manager
mas 'Tweetbot', id: 1384080005                      # Twitter client
mas 'Pocket', id: 568494494                         # Read Later service
mas 'Silicio', id: 933627574                        # Media miniplayer app
mas 'AdGuard for Safari', id: 1440147259            # Ad Blocker / Privacy
mas 'Pixelmator Pro', id: 1289583905                # Pro image editing
